app/controllers/calumnis_controller.rb

INSERT INTO "people" ("username", "password", "email", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["username", "1"], ["password", "1"], ["email", "ask@email.com"], ["description", "said"], ["created_at", "2017-10-18 07:06:07.058798"], ["updated_at", "2017-10-18 07:06:07.058798"]]
---
  def createandlogin
    p "in createandlogin",params[:people],people_params,cookies[:email]
    params[:people][:email]=cookies[:email]
    people_params[:email]=cookies[:email]
    p people_params,"again"
    @calumni = People.create!(people_params)

SELECT  "people".* FROM "people" WHERE "people"."email" = ? LIMIT 1  [["email", "oncepad@gmail.com"]]
---
  def profile

    # check username and password first
    # p params

    # save

    p cookies[:email]
    @people= People.select{|p| p.email==cookies[:email]}

SELECT "people".* FROM "people"
---
  def create_mentor
    # byebug

    # check user exists or not
    p @people
    ok= People.select{|p| p.email==cookies[:email]}